#Пошук підрядка
#Гармідер Анастасія,122-В
s='Гравітація на поверхні Сонця в 28 разів перевищує гравітацію Землі, якщо там зявиться, людина вагою 60 кг ' \
  'буде почувати себе на всі 1680 кг.'
print(s)
s1=input('Введіть підрядок ')#Підрядка не буде знайдена, якщо її не буде в рядку, тоді виведе що підрядок не знайдено
i=-1 #індекси рядки
j=0#Індексі подстроки
while (j<len(s1)) and i<(len(s)-len(s1)):
    j=0
    i+=1 #Кількість зсувів, і одночасно наша позиція
    while j<len (s1) and s1[j]==s[i+j]:
        j+=1
if (j==len(s1)):
    print(f'Підрядок знайдений в позиції {i},за {i} переміщень')
else:
    print('Підрядок не знайдений')
